#1:

Mostrar las primeras 5 filas de los dataframes

________________________________________________________________________________

In [57]:
import pandas as pd 

df_asig = pd.read_csv('../GENERADOR/asignaturas.csv')
df_est = pd.read_csv('../GENERADOR/estudiantes.csv')
df_not = pd.read_csv('../GENERADOR/notas.csv')

df_asig.head(5)

   id_asignatura nombre_asignatura departamento  creditos
0              1       Matemáticas     Ciencias         6
1              2            Física     Ciencias         5
2              3          Historia  Humanidades         4
3              4   Lengua Española  Humanidades         5
4              5       Informática   Ingeniería         6

In [58]:
df_est.head(5)

   id_estudiante    nombre  apellido  edad sexo      ciudad fecha_registro
0              1     Lucía  Torrents    28    M     Granada     2023-11-10
1              2  Cayetana     Belda    18    F       Soria     2022-09-19
2              3       Noé     Ayala    21    M       Cádiz     2025-01-02
3              4    Hernán  Zamorano    20    M  Pontevedra     2022-06-15
4              5   Conrado  Busquets    28    M  Las Palmas     2024-07-25

In [59]:
df_not.head(5)

   id_estudiante  id_asignatura  nota    convocatoria fecha_examen
0              1              1  7.25       Ordinaria   2024-04-14
1              1              2  6.29  Extraordinaria   2024-10-10
2              1              5  7.47       Ordinaria   2023-11-17
3              2              5  8.78       Ordinaria   2024-03-14
4              2              6  6.15       Ordinaria   2024-07-05

#2:

Mostrar información general de los dataframes

________________________________________________________________________________

In [60]:
df_asig.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id_asignatura      6 non-null      int64
 1   nombre_asignatura  6 non-null      object
 2   departamento       6 non-null      object
 3   creditos           6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [61]:
df_est.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_estudiante   100 non-null    int64
 1   nombre          100 non-null    object
 2   apellido        100 non-null    object
 3   edad            100 non-null    int64
 4   sexo            100 non-null    object
 5   ciudad          100 non-null    object
 6   fecha_registro  100 non-null    object
dtypes: int64(2), object(5)
memory usage: 5.6+ KB

In [62]:
df_not.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id_estudiante  300 non-null    int64
 1   id_asignatura  300 non-null    int64
 2   nota           300 non-null    float64
 3   convocatoria   300 non-null    object
 4   fecha_examen   300 non-null    object
dtypes: float64(1), int64(2), object(2)
memory usage: 11.8+ KB

#3:

Comprobar valores faltantes

________________________________________________________________________________

In [63]:
print(df_asig.isnull().sum())

id_asignatura        0
nombre_asignatura    0
departamento         0
creditos             0
dtype: int64

In [64]:
print(df_est.isnull().sum())

id_estudiante     0
nombre            0
apellido          0
edad              0
sexo              0
ciudad            0
fecha_registro    0
dtype: int64

In [65]:
print(df_not.isnull().sum())

id_estudiante    0
id_asignatura    0
nota             0
convocatoria     0
fecha_examen     0
dtype: int64

#4:

Calcular estadisticas numéricas

________________________________________________________________________________

In [66]:
print(df_asig.describe())

       id_asignatura  creditos
count       6.000000  6.000000
mean        3.500000  5.166667
std         1.870829  0.752773
min         1.000000  4.000000
25%         2.250000  5.000000
50%         3.500000  5.000000
75%         4.750000  5.750000
max         6.000000  6.000000

In [67]:
print(df_est.describe())

       id_estudiante        edad
count     100.000000  100.000000
mean       50.500000   24.710000
std        29.011492    3.901036
min         1.000000   18.000000
25%        25.750000   21.000000
50%        50.500000   26.000000
75%        75.250000   28.000000
max       100.000000   30.000000

In [68]:
print(df_not.describe())

       id_estudiante  id_asignatura        nota
count     300.000000     300.000000  300.000000
mean       50.500000       3.426667    6.481500
std        28.914301       1.671507    1.445426
min         1.000000       1.000000    1.640000
25%        25.750000       2.000000    5.475000
50%        50.500000       3.000000    6.590000
75%        75.250000       5.000000    7.440000
max       100.000000       6.000000   10.000000

#5:

Comprobar duplicados

________________________________________________________________________________

In [69]:
print(df_asig.duplicated().sum())

0

In [70]:
print(df_est.duplicated().sum())

0

In [71]:
print(df_not.duplicated().sum())

0